AUTO_config_TK_pesok/src/InformationRegisters/ТК_СостояниеДокументов/ТК_СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_СостояниеДокументов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыСборкиРезервов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.ОбъектыСоСтатусами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ОчередьНаСборкуРезервов/ТК_ОчередьНаСборкуРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ОчередьНаСборкуРезервов</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыСборки</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСборкиРезервов</types>
    </type>
  </resources>
  <resources>
    <name>НачалоСборки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КонецСборки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СотрудникКонтроля</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>НачалоКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КонецКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Упаковщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДопСборщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РезервированиеЗаказовПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Enums/СтатусыСборкиРезервов/СтатусыСборкиРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСборкиРезервов</name>
  <enumValues>
    <name>ГотовКСборке</name>
  </enumValues>
  <enumValues>
    <name>ВСборке</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
    <comment>Статус для документов собранных и сформированы документы</comment>
  </enumValues>
  <enumValues>
    <name>Доставляется</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НеНачат</name>
  </enumValues>
  <enumValues>
    <name>Проведен</name>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>статус для акта</comment>
  </enumValues>
  <enumValues>
    <name>СогласованоРЦ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоРЦ</name>
  </enumValues>
  <enumValues>
    <name>СогласованоСБ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоСБ</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <basedOn>Document.ТК_ЗаявкаНаПеремещение</basedOn>
  <basedOn>Document.ВыпускПродукции</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваровТМП</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровКомпании</registerRecords>
  <registerRecords>AccumulationRegister.ПриходованиеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваровКомпании</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадкаПолучатель</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпанииПолучатель</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВхДокНомер</name>
    <comment>Номер входящего документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВхДокДата</name>
    <comment>Дата входящего документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДДокументаОтгрузки</name>
    <comment>ID документа отгрузки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>БратьСтоимостьИзДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.РезервированиеЗаказовПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ТК_ЗаявкаНаПеремещение</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерRB</name>
    <comment>Номер Open Store</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусRB</name>
    <comment>Статус выгрузки в Open Store</comment>
    <type>
      <types>EnumRef.СтатусыВыгрузкиRB</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытиеЗаказовПокупателей</name>
    <comment> 0 - Ручное распределение, 1 - Закрывать (по-умолчанию), 2 - Не закрывать</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяВозврата</name>
    <type>
      <types>CatalogRef.СтатьиВозврата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеОтгрузки</name>
    <comment>Распределение отгрузки по заказам покупателей</comment>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_СостояниеДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	//
	//Ограничение.Текст =
	//"РазрешитьЧтениеИзменение
	//|	ГДЕ
	//|	 ЗначениеРазрешено(ТорговаяПлощадка)";
	//
	//Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти




Процедура ЗаписатьИзмененияПоОснованию(Документ,ДокументОснование,Состояние,СтрудникМенеджер,ТорговаяПлощадкаСсылка)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК СсылкаОснование
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
	|ГДЕ
	|	НЕ СвязанныеДокументы.Ссылка = &ДокСканирование
	|	И НЕ СвязанныеДокументы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ДокСканирование", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборСостояение = РегистрыСведений.ТК_СостояниеДокументов.СоздатьНаборЗаписей();
		НаборСостояение.Отбор.СсылкаНаОбъект.Установить(ВыборкаДетальныеЗаписи.СсылкаОснование);
		нЗапись = НаборСостояение.Добавить();
		нЗапись.СсылкаНаОбъект = ВыборкаДетальныеЗаписи.СсылкаОснование;
		нЗапись.Состояние = Состояние;
		нЗапись.ДатаПоследнегоИзменения = ТекущаяДатаСеанса();
		нЗапись.АвторИзменения = СтрудникМенеджер;
		нЗапись.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
		НаборСостояение.Записать();
		типОснование = ТипЗнч(ВыборкаДетальныеЗаписи.СсылкаОснование);
		Если типОснование = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
			НаборСостояение = РегистрыСведений.ТК_ОчередьНаСборкуРезервов.СоздатьНаборЗаписей();
			НаборСостояение.Отбор.Документ.Установить(ВыборкаДетальныеЗаписи.СсылкаОснование);
			НаборСостояение.Прочитать();
			Если НаборСостояение.Количество() = 1 Тогда
				ЗаписьСостояния = НаборСостояение[0];
				ЗаписьСостояния.Статус = Состояние;
				НаборСостояение.Записать();
			КонецЕсли;
		//ИначеЕсли типОснование = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
	
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры


Функция ПолучитьСостояниеДокумента(Документ)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТК_СостояниеДокументов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.ТК_СостояниеДокументов КАК ТК_СостояниеДокументов
	|ГДЕ
	|	ТК_СостояниеДокументов.СсылкаНаОбъект = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.СтатусыСборкиРезервов.НеНачат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Возврат ВыборкаДетальныеЗаписи.Состояние;
	
КонецФункции

Процедура УстановитьСостояниеДокумента(Документ,СтруктураСостояние,ВключаяПодчиненный = Ложь)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ТК_СостояниеДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(Документ);
	нЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(нЗапись,СтруктураСостояние);
	нЗапись.СсылкаНаОбъект = Документ;
	НаборЗаписей.ОбменДанными.Загрузка = Истина;

	НаборЗаписей.Записать();
	
	Если ВключаяПодчиненный Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
		|ГДЕ
		|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеТоваров";
		
		Запрос.УстановитьПараметр("ДокументОснование", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();	
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ВыборкаДетальныеЗаписи.Ссылка,СтруктураСостояние,Ложь);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура УдалитьСостояниеДокумента(Документ)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ТК_СостояниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СсылкаНаОбъект = Документ;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры


//Документ собран/отгружен/Доставляется/Доставлен/принят считается проведенным
Функция ПолучитьАктуальныйСтатусДокумента(Документ)Экспорт
	текСтатус = ПолучитьСостояниеДокумента(Документ);
	Если текСтатус =  Перечисления.СтатусыСборкиРезервов.Собран
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Отгружен
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Доставляется
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Проведен
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Доставлен Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
КонецФункции


#КонецОбласти
	
	
	
#КонецЕсли
